title: Invoke-Phant0m detection
status: experimental
description: Detects process access to svchost which is typical for Invoke-Phant0m (Granted Access = 0x1f3fff). Because of PowerShell and NotPowerShell and other sneaky stuff it doesn't search for PowerShell.exe
references:
    - https://artofpwn.com/phant0m-killing-windows-event-log.html
    - https://azure.microsoft.com/en-us/blog/detecting-in-memory-attacks-with-sysmon-and-azure-security-center/
tags:
    - attack.t1089
    - attack.defense_evasion
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 10
        TargetImage: 'C:\windows\system32\svchost.exe'
        GrantedAccess: '0x1f3fff'
    keywords:
        - ntdll.dll
        - kernelbase.dll
        - unknown
    condition: selection and all of keywords
falsepositives:
    - unknown
level: high